20211227220104-waste_free_sequential_monte_carlo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-24 Wed 04:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Waste-free Sequential Monte Carlo</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Waste-free Sequential Monte Carlo</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220306194751-markov_chain_monte_carlo_new.html#ID-5acc4f0f-417e-424f-95a5-1c95e7e822ff">Markov Chain Monte Carlo</a></dd>
</dl>

<p>
Algorithm from <a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/2011.02328">this article.</a>
</p>

<ul class="org-ul">
<li>How many MCMC steps needed for optimal performace? (always set arbitratily)</li>
<li>Number of steps should be set adaptively, especially for situation like tmpering.</li>
<li><p>
Intermediate steps are wasted.
</p>

<p>
Waste-free SMC uses intermediate steps as new particles.
</p></li>
</ul>


<div id="outline-container-orge4008e5" class="outline-2">
<h2 id="orge4008e5">Principle</h2>
<div class="outline-text-2" id="text-orge4008e5">
<p>
If there are \(N\) particles, we only resample \(M = N/P\) particles. Each resampled particle is moved \(P-1\) times and each iterate is taken to form a new sample of size \(N\).
</p>

<p>
How can we integrate both processes in the same algorithm?
</p>

<p>
The implement of sequential MC first consists in a resampling step:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">resampling_idx</span> = resampling_fn(weights, rng_key, num_resampled)
<span style="font-weight: bold; font-style: italic;">particles</span> = jax.tree_map(<span style="font-weight: bold;">lambda</span> x: x[resampling_index], particles)
</pre>
</div>

<p>
We can only resample between \(1\) and \(N\) particles. But since we dont'
</p>

<p>
Waste-free SMC may be recast as a standard SMC sampler that propopagates and reweighs particles that are markov chains of length P.
</p>

<p>
Indeed we have \(M\) chains of length \(P\).
</p>

<p>
\(z \in \mathcal{Z} = \Xi^P\). The potential functions are as:
</p>

\begin{equation}
  G^{wf}(z) = \frac{1}{P} \sum_{p=1}^{P} G_{t}(z[p])
\end{equation}

<p>
and the initial distribution
</p>

\begin{equation}
  \nu^{wf}(\mathrm{d}z) = \prod_{p=1}^{P} \nu(\mathrm{d}z[p])
\end{equation}

<p>
And the transition kernel:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="font-weight: bold;">\begin</span>{<span style="font-weight: bold;">equation</span>}
 M_{t}^{wf}(z_{t-1}, <span style="font-weight: bold;">\mathrm</span>{d}z_{t}) = <span style="font-weight: bold;">\left\{\sum</span>_{p=1}^{P}<span style="font-weight: bold;">\right\}</span>
<span style="font-weight: bold;">\end</span>{<span style="font-weight: bold;">equation</span>}
</pre>
</div>

<ol class="org-ol">
<li>Choose one chain of length \(P\) with probability \(\propto \sum_p G_{t-1}(z_{t-1}[p])\);</li>
<li>Choose one component \(q\) randomly with probability \(\propto G_{t-1}(z_{t-1}[q])\) to be the starting point of the next chain;</li>
<li>Repeat</li>
</ol>

<p>
Which leads to the algorithm 2 in the paper:
</p>

<ol class="org-ol">
<li>sampled<sub>idx</sub> &lt;- resample(M, weights)</li>
<li>sampled<sub>particles</sub> = particles[sampled<sub>idx</sub>]</li>
<li>traces = jax.scan(jax.vmap(mcmc)(keys, new<sub>particles</sub>), P)</li>
<li>particles = traces.flatten()</li>
<li>weights = G(particles)</li>
<li>return particles, weights</li>
</ol>


<p>
The equivalent algorithm 1 would be:
</p>

<ol class="org-ol">
<li>sampled<sub>particles</sub> = particles</li>
<li>traces = jax.scan(jax.vmap(mcmc)(keys, new<sub>particles</sub>), P)</li>
<li>particles = traces[-1, :]</li>
<li>weights = G(particles)</li>
<li>return particles, weights</li>
</ol>
</div>
</div>


<div id="outline-container-orgf34e709" class="outline-2">
<h2 id="orgf34e709">Code</h2>
<div class="outline-text-2" id="text-orgf34e709">
<p>
Let us now refactor the original smc code:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">smc</span>(
    mcmc_kernel_factory: Callable,
    mcmc_state_generator: Callable,
    resampling_fn: Callable,
    num_mcmc_iterations: <span style="font-weight: bold;">int</span>,
    is_waste_free: <span style="font-weight: bold;">bool</span> = <span style="font-weight: bold; text-decoration: underline;">False</span>,
):

    <span style="font-weight: bold;">if</span> is_waste_free:
        <span style="font-weight: bold; font-style: italic;">num_mcmc_iterations</span> = num_mcmc_iterations - 1

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">kernel</span>(
        rng_key: PRNGKey,
        state: SMCState,
        logprob_fn: Callable,
        log_weight_fn: Callable,
    ) -&gt; Tuple[SMCState, SMCInfo]:

        <span style="font-weight: bold; font-style: italic;">weights</span>, <span style="font-weight: bold; font-style: italic;">particles</span> = state
        <span style="font-weight: bold; font-style: italic;">scan_key</span>, <span style="font-weight: bold; font-style: italic;">resampling_key</span> = jax.random.split(rng_key, 2)

        <span style="font-weight: bold; font-style: italic;">num_particles</span> = weights.shape[0]
        <span style="font-weight: bold;">if</span> is_waste_free:
            <span style="font-weight: bold; font-style: italic;">sub_num_particles</span>, <span style="font-weight: bold; font-style: italic;">remainder</span> = <span style="font-weight: bold;">divmod</span>(
                num_particles, num_mcmc_iterations + 1
            )
            <span style="font-weight: bold;">if</span> remainder &gt; 0:
                <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span>(
                    <span style="font-style: italic;">"`num_mcmc_iterations` must be a divider "</span>
                    f<span style="font-style: italic;">"of `num_particles`, {num_mcmc_iterations} and "</span>
                    f<span style="font-style: italic;">"{num_particles} were given"</span>
                )
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold; font-style: italic;">sub_num_particles</span> = num_particles

        <span style="font-weight: bold; font-style: italic;">resampling_index</span> = resampling_fn(weights, resampling_key, sub_num_particles)
        <span style="font-weight: bold; font-style: italic;">particles</span> = jax.tree_map(<span style="font-weight: bold;">lambda</span> x: x[resampling_index], particles)

        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">First advance the particles using the MCMC kernel</span>
        <span style="font-weight: bold; font-style: italic;">mcmc_kernel</span> = mcmc_kernel_factory(logprob_fn)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">mcmc_body_fn</span>(carry, curr_key):
            <span style="font-weight: bold; font-style: italic;">curr_particles</span>, <span style="font-weight: bold; font-style: italic;">n_accepted</span> = carry
            <span style="font-weight: bold; font-style: italic;">keys</span> = jax.random.split(curr_key, sub_num_particles)
            <span style="font-weight: bold; font-style: italic;">new_particles</span>, <span style="font-weight: bold; font-style: italic;">mcmc_info</span> = jax.vmap(mcmc_kernel, in_axes=(0, 0))(
                keys, curr_particles
            )
            <span style="font-weight: bold; font-style: italic;">n_accepted</span> = n_accepted + mcmc_info.is_accepted
            <span style="font-weight: bold;">return</span> (new_particles, n_accepted), new_particles

        <span style="font-weight: bold; font-style: italic;">mcmc_state</span> = jax.vmap(mcmc_state_generator, in_axes=(0, <span style="font-weight: bold; text-decoration: underline;">None</span>))(
            particles, logprob_fn
        )

        <span style="font-weight: bold; font-style: italic;">keys</span> = jax.random.split(scan_key, num_mcmc_iterations)
        (proposed_states, total_accepted), <span style="font-weight: bold; font-style: italic;">proposed_states_history</span> = jax.lax.scan(
            mcmc_body_fn, (mcmc_state, jnp.zeros((sub_num_particles,))), keys
        )
        <span style="font-weight: bold; font-style: italic;">acceptance_rate</span> = jnp.mean(total_accepted / num_mcmc_iterations)

        <span style="font-weight: bold;">if</span> is_waste_free:
            <span style="font-weight: bold; font-style: italic;">initial_position</span>, <span style="font-weight: bold; font-style: italic;">tree_def</span> = jax.tree_flatten(mcmc_state.position)
            <span style="font-weight: bold; font-style: italic;">chains_history</span>, <span style="font-weight: bold; font-style: italic;">_</span> = jax.tree_flatten(proposed_states_history.position)

            <span style="font-weight: bold; font-style: italic;">position_history</span> = [
                jnp.concatenate([jnp.expand_dims(elem1, 0), elem2])
                <span style="font-weight: bold;">for</span> elem1, elem2 <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">zip</span>(initial_position, chains_history)
            ]
            <span style="font-weight: bold; font-style: italic;">position_history</span> = jax.tree_unflatten(tree_def, position_history)
            <span style="font-weight: bold; font-style: italic;">proposed_particles</span> = jax.tree_map(
                <span style="font-weight: bold;">lambda</span> z: jnp.reshape(z, (num_particles,) + z.shape[2:]),
                position_history,
            )

        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold; font-style: italic;">proposed_particles</span> = proposed_states.position
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Resample the particles depending on their respective weights</span>
        <span style="font-weight: bold; font-style: italic;">log_weights</span> = jax.vmap(log_weight_fn, in_axes=(0,))(proposed_particles)
        <span style="font-weight: bold; font-style: italic;">weights</span>, <span style="font-weight: bold; font-style: italic;">log_likelihood_increment</span> = _normalize(log_weights)

        <span style="font-weight: bold; font-style: italic;">state</span> = SMCState(weights, proposed_particles)
        <span style="font-weight: bold; font-style: italic;">info</span> = SMCInfo(resampling_index, log_likelihood_increment, acceptance_rate)
        <span style="font-weight: bold;">return</span> state, info

    <span style="font-weight: bold;">return</span> kernel
</pre>
</div>

<p>
First separate vanilly and waste-free SMC:
</p>
</div>
</div>

<div id="outline-container-orgd22e693" class="outline-2">
<h2 id="orgd22e693">Links to this note</h2>
</div>
</div>
</body>
</html>
